[
    {
        "query": "Marriage equality",
        "links": [
            {
                "link": "https://apnews.com/article/japan-lgbtq-samesex-marriage-ruling-constitution-ldp-a1528f5daf4d642dfa74d61f59953252",
                "name": "AP News\nJapan's ban on recognizing same-sex unions is unconstitutional, a court finds. Here's what to know\nA Japanese high court has ruled that the refusal to recognize same-sex marriage is unconstitutional, the latest victory for the LGBTQ+...\n.\n4 hours ago"
            },
            {
                "link": "https://english.kyodonews.net/news/2024/12/61f3ab4f1d92-update1-japan-high-court-rules-same-sex-marriage-ban-unconstitutional.html",
                "name": "Kyodo News+ | Japan's leading news agency.\nJapan high court rules same-sex marriage ban unconstitutional\nThe Fukuoka High Court becomes the third high court in Japan to rule the country's lack of legal recognition of same-sex marriage is...\n.\n7 hours ago"
            },
            {
                "link": "https://wordandway.org/2024/12/13/black-denomination-upholds-stance-against-same-sex-marriage-a-gay-pastor-in-its-ranks-seeks-change/",
                "name": "Word&Way\nBlack Denomination Upholds Stance Against Same-Sex Marriage. A Gay Pastor in Its Ranks Seeks Change\nWhen the African Methodist Episcopal Church, arguably the world's largest independent Black Protestant denomination, held its quadrennial...\n.\n2 hours ago"
            },
            {
                "link": "https://www.cbsnews.com/news/trump-harris-lgbtq-rights-2024/",
                "name": "CBS News\nCompare Trump and Harris' views on LGBTQ rights and marriage equality\nFormer President Donald Trump and Vice President Kamala Harris have starkly different messages and backgrounds.\n.\n1 month ago"
            },
            {
                "link": "https://www.washingtonpost.com/obituaries/2024/11/13/ted-olson-lawyer-bush-gay-rights-dead/",
                "name": "Washington Post\nTheodore Olson, conservative lawyer who backed marriage equality, dies at 84\nTheodore Olson, conservative lawyer who backed marriage equality, dies at 84. A longtime Republican who helped George W. Bush secure the...\n.\n1 month ago"
            }
        ]
    }
]